var obj = {
    "title": "《入海》",
    "author": "毛不易",
    "txt": [
        "00:00.00=入海 - 毛不易",
        "00:03.68=词：马晓波",
        "00:04.54=曲：赵兆",
        "00:04.63=编曲：宋涛/赵兆",
        "00:04.86=出品：bilibili",
        "00:04.97=制作人：赵兆",
        "00:05.13=钢琴：赵兆",
        "00:05.26=吉他：薛峰",
        "00:05.39=贝斯：韩阳",
        "00:05.52=鼓：武勇恒",
        "00:05.66=小提琴：李朋",
        "00:05.82=大提琴：张平",
        "00:05.98=弦乐：国际首席爱乐乐团",
        "00:06.90=合唱团：悦伴歌声合唱团",
        "00:07.23=录音师：邢铜/李杨/王小四/妙妙",
        "00:07.73=混音：李游",
        "00:07.86=母带：李游",
        "00:08.34=录音棚：55TEC/金田录音棚/A8录音棚",
        "00:16.93=还有说不完的话",
        "00:20.58=风催着我们出发",
        "00:24.13=把笑和泪都留下",
        "00:27.58=留在这一年的夏",
        "00:31.68=对于未来的想法",
        "00:35.22=有太多疑问没有回答",
        "00:38.96=关于面包和理想",
        "00:41.70=还有平凡和伟大",
        "00:47.54=那就这样出发",
        "00:50.53=再见吧 和我一样匆忙的人啊",
        "00:56.48=你们的歌声",
        "00:58.42=在遥远的路上轻轻回响",
        "01:08.08=时间会回答成长",
        "01:10.76=成长会回答梦想",
        "01:15.01=梦想会回答生活",
        "01:18.76=生活回答你我的模样",
        "01:22.85=海洋会回答江湖",
        "01:25.70=江湖会回答河流",
        "01:30.27=河流会回答浪潮",
        "01:33.84=一起跃入人海",
        "01:37.65=做一朵奔涌的浪花",
        "02:09.71=还有说不完的话",
        "02:13.21=风催着我们出发",
        "02:16.86=那个平凡的背影",
        "02:20.29=去远方还是故乡",
        "02:24.29=迎着明天的风沙",
        "02:27.70=有太多孤单无人回响",
        "02:31.35=你是否和我一样",
        "02:34.11=带着倔强不投降",
        "02:39.16=那就这样出发",
        "02:42.66=再见吧 和我一样匆忙的人啊",
        "02:48.09=你们的歌声",
        "02:50.07=在深夜的梦里轻轻回响",
        "02:55.68=时间会回答成长",
        "02:58.31=成长会回答梦想",
        "03:02.80=梦想会回答生活",
        "03:06.20=生活回答你我的模样",
        "03:10.26=海洋会回答江湖",
        "03:13.12=江湖会回答河流",
        "03:17.57=河流会回答浪潮",
        "03:21.10=一起跃入人海",
        "03:24.64=做一朵奔涌的浪花",
        "03:56.65=时间会回答成长",
        "03:59.23=成长会回答梦想",
        "04:03.74=梦想会回答生活",
        "04:07.36=生活回答你我的模样",
        "04:11.16=海洋会回答江湖",
        "04:14.04=江湖会回答河流",
        "04:18.40=河流会回答浪潮",
        "04:22.01=一起跃入人海",
        "04:25.47=做一朵奔涌的浪花",
        "04:28.19=时间会回答成长",
        "04:30.70=成长会回答梦想",
        "04:35.00=梦想会回答生活",
        "04:38.75=生活回答你我的模样",
        "04:42.56=海洋会回答江湖",
        "04:45.38=江湖会回答河流",
        "04:49.81=河流会回答浪潮",
        "04:53.25=一起跃入人海",
        "04:56.77=做一朵奔涌的浪花",
        "05:02.86=让我们跃入人海",
        "05:06.87=做一朵奔涌的浪花",
        "05:22.60=还有说不完的话",
        "05:25.99=我们现在就要出发",
        "05:29.56=有些问题",
        "05:33.05=还不需要回答",
        "05:37.78=唱着这首歌",
        "05:39.90=向着海的方向"
    ]
}
let timeClock;
function handleWords() {
    let word = {
        title: obj.title,
        author: obj.author,
        timer: [],
        text: []
    }
    let txt = obj.txt;
    let pre = 0;
    for (let i = 0 ; i < txt.length ; i++) {
        let data = obj.txt[i].split("=");
        let time = data[0].split(":");
        let mm = Number.parseInt(time[0]), ss = Number.parseInt(time[1] * 100) / 100;
        //console.log(time, mm, ss)
        word.timer.push(Math.ceil((mm * 60 + ss) * 1000) - pre);
        pre = Math.ceil((mm * 60 + ss) * 1000);
        word.text.push(data[1])
    }
    console.log(word);
    playMusic(word.text, word.timer, 0);
}

function playMusic(word, timer, index) {
    if (index == timer.length) {return ;}
    console.log(index, ':=>',word[index]);
    let start = Date().now;
    if ("pause") {
        let now = Date.now;
        let Index = index;
    }
    setTimeout(() => {
        playMusic(word, timer, index + 1);
    },timer[index])
}

handleWords();



/* 
    将滚动歌词处理成轮播图的形式
    递归设置定时器进行跑动就好。
    一共设置5个标签，这样能避免节点加载过多。
    暂停/播放时则清除定时器

*/


